cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "diff-so-fancy"
brew "eva"
brew "fd"
brew "gh"
brew "git"
brew "git-absorb"
brew "gnupg"
brew "jq"
brew "pure"
brew "ykman"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "appcleaner"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "little-snitch"
cask "raycast"
cask "rectangle"
cask "spotify"
