cask_args appdir: '/Applications'

tap 'puma/puma'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

brew 'diff-so-fancy'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'jq'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'pinentry-mac'
brew 'protobuf'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'rustup-init'
brew 'ssh-copy-id'
brew 'yarn'
brew 'zsh'

cask '1password-cli'
cask 'appcleaner'
cask 'calibre'
cask 'cursorsense'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'google-chrome'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'kap'
cask 'karabiner-elements'
cask 'keyboardcleantool'
cask 'little-snitch'
cask 'rectangle'
cask 'sequel-ace'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'

mas '1Password', id: 1333542190
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
